assignments/lab08/lab-08-recursive-binary-search.tex
% Created 2015-03-25 Wed 14:21
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\usepackage{minted}
\usemintedstyle{default}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Lab 08: Recursive Binary Search}
\author{CSci 515 Spring 2015}
\date{2015-02-18}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Lab 08 Restricted Binary Search},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle


\section*{Dates:}
\label{sec-1}


\begin{center}
\begin{tabular}{ll}
 Due:  &  In Lab, Wednesday March 25, by 4:05 pm (lab end time)  \\
\end{tabular}
\end{center}
\section*{Objectives}
\label{sec-2}

\begin{itemize}
\item Become more familiar with performing searches and sorts.
\item Practice passing arrays to and from functions.
\end{itemize}
\section*{Description}
\label{sec-3}

In class today we gave an example of a binary search implementation
using a straight forward iterative approach.  We kept track of the
unsearched region of the array, and calculated the midpoint, and
decided on a comparison with that midpoint whether to search to the
lower or upper part of the array.  Binary search can also be fairly
easily described as a recursive algorithm.  The basic idea of the
algorithm is:

\begin{itemize}
\item Recursive condition: Calculate the midpoint of the current array and
  compare the value to the search value.  If the value is greater than
  the search value, recursively call the function on the subarray to
  the left of the midpoint.  If the value is less than the search
  value, recursively call the function on the subarray to the right of
  the midpoint.
\item Base case 1: If the value is equal to the search item, we found it
  so return the midpoint.
\item Base case 2: If the subarray is empty, return a failure.
\end{itemize}

A specific description of the function/tasks to perform may make this
clearer.  You need to write a single function for this lab called
\verb~binarySearchRecursive~.  This function takes an array of integers,
and two indexes as its input parameters \verb~low~ and \verb~high~.  It also
takes an integer value which is the value to search for within the
indicated portion of the array.  As in class, the \verb~low~ and \verb~high~
represent the indexs of the unsearched portion of the array.  The
function can implement a binary search recursively by performing the
following steps:

\begin{enumerate}
\item If \verb~low~ > \verb~high~ then there is nothing left to search and the
   search has failed (base case 2).  In this case, return -1 to
   indicate a failure of the search.
\item Calculate the midpoint location between \verb~low~ and \verb~high~ in the
   same way as was done in class.
\item If the value at the midpoint is equal to the value being searched for
   then return the midpoint location (base case 1).
\item If the value at the midpoint is greater than the value being searched for
   then call \verb~binarySearchRecursive~ with \verb~low~ and \verb~midpoint~ - 1 (e.g. 
   search the lower subportion of the array recursively).
\item If the value at the midpoint is less than the value being search for 
   then call \verb~binarySearchRecursive~ with \verb~midpoint~ + 1 and \verb~high~.
\end{enumerate}

Your program output should look something close to the following when
I run your program.  In this example, I prompt the user for a value to
search for and then display the location where the item was found.  I
run the program twice so we can see an example of a successful and a
failed search.


\begin{verbatim}
$ ./lab08
Array, before being sorted:
000:  10
001:  11
002:  13
003:   1
004:  14
005:   9
006:   1
007:  13
008:   7
009:   4

Array, after being sorted sorted:
000:   1
001:   1
002:   4
003:   7
004:   9
005:  10
006:  11
007:  13
008:  13
009:  14

Enter a value and I will search for it in the array: 9
I found the value at location: 4

$ ./lab08
Array, before being sorted:
000:  19
001:   7
002:  15
003:  10
004:   3
005:  11
006:   4
007:  13
008:  16
009:  16

Array, after being sorted sorted:
000:   3
001:   4
002:   7
003:  10
004:  11
005:  13
006:  15
007:  16
008:  16
009:  19

Enter a value and I will search for it in the array: 5
Search failed, value: 5 not located in array
\end{verbatim}

In your \verb~main~ function, show an example of calling your recursive
binary search.  Create an array of 10 values, presorted (you can use a
static initializer to do this, or create an array of random values and
copy and use a sort function from class today).  Then call your
recursive binary search on your array of 10 values, and show that it
finds the location of the item being searched for.

\textbf{NOTE}: Now that our programs have more functions than just the
\verb~main()~ function, the use of the function headers becomes meaningful
and required.  Make sure that all of your functions have function
headers preceding them that document the purpose of the functions, and
the input parameters and return value of the function.
\section*{Lab Submission}
\label{sec-4}


An eCollege dropbox has been created for this lab.  You should
upload your version of the lab by the end of lab time to the eCollege
dropbox named \verb~Lab 06 Processing Arrays~.  Work submitted by the end
of lab will be considered, but after the lab ends you may no longer
submit work, so make sure you submit your best effort by the lab end
time in order to receive credit.
\section*{Requirements and Grading Rubrics}
\label{sec-5}
\subsection*{Program Execution, Output and Functional Requirements}
\label{sec-5-1}


\begin{enumerate}
\item Your program must compile, run and produce some sort of output to be
  graded. 0 if not satisfied.
\item 50+ pts.  Your program must have the required named function,
   that accepts the required input parameters and return the required
   values (if any).
\item 20+ pts. The function must be implemented correctly.  The function
   must be working.
\item 30+ pts. Your main function must create an array and demonstrate
   calling the recursive binary search function correctly.
\end{enumerate}
\subsection*{Program Style}
\label{sec-5-2}


Your programs must conform to the style and formatting guidelines given for this course.
The following is a list of the guidelines that are required for the lab to be submitted
this week.

\begin{enumerate}
\item The file header for the file with your name and program information
  and the function header for your main function must be present, and
  filled out correctly.
\item A function header must be present for all functions you define.
   You must document the purpose, input parameters and return values
   of all functions.  Your function headers must be formatted exactly
   as shown in the style guidelines for the class.
\item You must indent your code correctly and have no embedded tabs in
  your source code. (Don't forget about the Visual Studio Format
  Selection command).
\item You must not have any statements that are hacks in order to keep
   your terminal from closing when your program exits (e.g. no calls
   to system() ).
\item You must have a single space before and after each binary operator.
\item You must have a single blank line after the end of your declaration
  of variables at the top of a function, before the first code
  statement.
\item You must have a single blank space after , and \verb~;~ operators used as a
  separator in lists of variables, parameters or other control
  structures.
\item You must have opening \verb~{~ and closing \verb~}~ for control statement blocks
  on their own line, indented correctly for the level of the control
  statement block.
\item All control statement blocks (if, for, while, etc.) must have \verb~{~
   \verb~}~ enclosing them, even when they are not strictly necessary
   (when there is only 1 statement in the block).
\item You should attempt to use meaningful variable and function names in
   your program, for program clarity.  Of course, when required, you
   must name functions, parameters and variables as specified in the
   assignments.  Variable and function names must conform to correct
   \verb~camelCaseNameingConvention~ .
\end{enumerate}

Failure to conform to any of these formatting and programming practice
guidelines for this lab will result in at least 1/3 of the points (33)
for the assignment being removed for each guideline that is not
followed (up to 3 before getting a 0 for the assignment). Failure to
follow other class/textbook programming guidelines may result in a
loss of points, especially for those programming practices given in
our Deitel textbook that have been in our required reading so far.

\end{document}
